src/InformationRegisters/Базар_СопроводительныеДокументы/Базар_СопроводительныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Базар_СопроводительныеДокументы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыСопроводительныхДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтандартНаПродукцию</name>
    <type>
      <types>CatalogRef.СтандартыНаВыбработкуПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>GUIDИзображения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СопроводительныйДокумент/СопроводительныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СопроводительныйДокумент</name>
  <registerRecords>InformationRegister.Базар_СопроводительныеДокументы</registerRecords>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыСопроводительныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыНаПродукцию</name>
    <attributes>
      <name>СтандартНаПродукцию</name>
      <type>
        <types>CatalogRef.СтандартыНаВыбработкуПродукции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Изображения</name>
    <attributes>
      <name>GUIDИзображения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Базар_СопроводительныеДокументы/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Номенклатура") тогда
		Элементы.GUIDИзображения.Видимость = Ложь;
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.СтандартНаПродукцию.Видимость = Ложь;
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНоменклатуре", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Отбор.Номенклатура);
	КонецЕсли;
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.СопроводительныйДокумент);
	Элементы.ПодменюСоздать.Видимость = МожноРедактировать;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Для Каждого Значение из Метаданные.Перечисления.Базар_ВидыСопроводительныхДокументов.ЗначенияПеречисления цикл
		Элемент = Элементы.Найти("ФормаСоздать"+Значение.Имя);
		Если Элемент <> Неопределено тогда
			Элемент.Заголовок = Значение.Синоним;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйДокумент(Команда)
	
	СтрВидОперации = СтрЗаменить(Команда.Имя, "Создать", "");	
	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(
		ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов." + СтрВидОперации));
	ОткрытьФорму("Документ.СопроводительныйДокумент.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруПараметровФормы(ВидОперации)

	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "СозданиеФормыСопроводительныйДокумент");
	
	СтруктураПараметров = Новый Структура;
	
	ЗначенияЗаполнения = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Элементы.Список.ТекущиеДанные = Неопределено тогда
		ПараметрыДляПередачи = Новый Структура;
		ПараметрыДляПередачи.Вставить("Ключ", Элементы.Список.ТекущиеДанные.Регистратор);
		
		ОткрытьФорму("Документ.СопроводительныйДокумент.ФормаОбъекта", ПараметрыДляПередачи);
	КонецЕсли;
	
КонецПроцедуры
